# 1.튜플의 인덱싱
t1 = (1, 2, 'a', 'b')
print(t1[0])                        # 1
print(t1[1])                        # 2
print(t1[2])                        # a
print(t1[3])                        # b
print(t1[-1])                       # b

# 2. 튜플의 슬라이싱
# [ start index : end index ]
t2 = (10, 20, 30, 40, 50)
print(t2[1:3])                      # 인덱스 1~2번까지 슬라이싱  : (20, 30)
print(t2[ :4])                      # 처음부터 3번까지 슬라이싱  : (10, 20, 30, 40)
print(t2[1:])                       # 인덱스 1번부터 끝까지 슬라이싱 : (20, 30, 40, 50)

# 3. 튜플 더하기 : +
print(t1 + t2)                      # (1, 2, 'a', 'b', 10, 20, 30, 40, 50)
print(t2 + t1)                      # (10, 20, 30, 40, 50, 1, 2, 'a', 'b')

# 4. 튜플 곱하기 : * (반복)
print(t2 * 3)                       # (10, 20, 30, 40, 50, 10, 20, 30, 40, 50, 10, 20, 30, 40, 50)

